### Terraform Plan: `staging`

```
Acquiring state lock. This may take a few moments...
module.cloud_sql_auth.random_password.db_password: Refreshing state... [id=none]
random_password.vapid_placeholder: Refreshing state... [id=none]
random_password.jwt_secret: Refreshing state... [id=none]
module.cloud_sql_fhir[0].random_password.db_password: Refreshing state... [id=none]
module.cloud_sql_ehrbase[0].random_password.db_password: Refreshing state... [id=none]
data.google_project.project: Reading...
google_artifact_registry_repository.docker: Refreshing state... [id=projects/quill-medical-staging/locations/europe-west2/repositories/quill]
module.secrets.google_secret_manager_secret.secrets["ehrbase-db-password"]: Refreshing state... [id=projects/quill-medical-staging/secrets/ehrbase-db-password]
module.secrets.google_secret_manager_secret.secrets["auth-db-password"]: Refreshing state... [id=projects/quill-medical-staging/secrets/auth-db-password]
module.secrets.google_secret_manager_secret.secrets["fhir-db-password"]: Refreshing state... [id=projects/quill-medical-staging/secrets/fhir-db-password]
module.secrets.google_secret_manager_secret.secrets["ehrbase-admin-password"]: Refreshing state... [id=projects/quill-medical-staging/secrets/ehrbase-admin-password]
module.secrets.google_secret_manager_secret.secrets["vapid-private"]: Refreshing state... [id=projects/quill-medical-staging/secrets/vapid-private]
module.monitoring.google_monitoring_uptime_check_config.health["staging.quill-medical.com"]: Refreshing state... [id=projects/quill-medical-staging/uptimeCheckConfigs/health-staging-quill-medical-com-CPEfouKbm4E]
module.secrets.google_secret_manager_secret.secrets["jwt-secret"]: Refreshing state... [id=projects/quill-medical-staging/secrets/jwt-secret]
module.secrets.google_secret_manager_secret.secrets["ehrbase-api-password"]: Refreshing state... [id=projects/quill-medical-staging/secrets/ehrbase-api-password]
module.networking.google_compute_network.vpc: Refreshing state... [id=projects/quill-medical-staging/global/networks/quill-vpc-staging]
module.monitoring.google_monitoring_notification_channel.email: Refreshing state... [id=projects/quill-medical-staging/notificationChannels/17216530059845075319]
module.compute_fhir[0].google_service_account.fhir_vm: Refreshing state... [id=projects/quill-medical-staging/serviceAccounts/fhir-vm-staging@quill-medical-staging.iam.gserviceaccount.com]
google_secret_manager_secret_version.jwt_secret: Refreshing state... [id=projects/938188914127/secrets/jwt-secret/versions/1]
google_secret_manager_secret_version.vapid_private: Refreshing state... [id=projects/938188914127/secrets/vapid-private/versions/1]
module.cloud_sql_ehrbase[0].google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/938188914127/secrets/ehrbase-db-password/versions/1]
module.cloud_sql_fhir[0].google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/938188914127/secrets/fhir-db-password/versions/1]
data.google_project.project: Read complete after 0s [id=projects/quill-medical-staging]
module.cloud_sql_auth.google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/938188914127/secrets/auth-db-password/versions/1]
google_project_iam_member.cloudrun_secret_accessor: Refreshing state... [id=quill-medical-staging/roles/secretmanager.secretAccessor/serviceAccount:938188914127-compute@developer.gserviceaccount.com]
module.compute_fhir[0].google_project_iam_member.fhir_vm_log_writer: Refreshing state... [id=quill-medical-staging/roles/logging.logWriter/serviceAccount:fhir-vm-staging@quill-medical-staging.iam.gserviceaccount.com]
module.monitoring.google_monitoring_alert_policy.uptime: Refreshing state... [id=projects/quill-medical-staging/alertPolicies/245523677435010723]
module.compute_fhir[0].google_project_iam_member.fhir_vm_secret_accessor: Refreshing state... [id=quill-medical-staging/roles/secretmanager.secretAccessor/serviceAccount:fhir-vm-staging@quill-medical-staging.iam.gserviceaccount.com]
module.networking.google_compute_firewall.allow_health_check: Refreshing state... [id=projects/quill-medical-staging/global/firewalls/allow-health-check-staging]
module.networking.google_compute_subnetwork.private: Refreshing state... [id=projects/quill-medical-staging/regions/europe-west2/subnetworks/quill-private-staging]
module.networking.google_compute_firewall.deny_db_ingress: Refreshing state... [id=projects/quill-medical-staging/global/firewalls/deny-db-ingress-staging]
module.networking.google_compute_global_address.private_ip_range: Refreshing state... [id=projects/quill-medical-staging/global/addresses/quill-private-ip-staging]
module.networking.google_compute_firewall.allow_iap_ssh: Refreshing state... [id=projects/quill-medical-staging/global/firewalls/allow-iap-ssh-staging]
module.networking.google_vpc_access_connector.connector: Refreshing state... [id=projects/quill-medical-staging/locations/europe-west2/connectors/quill-vpc-cx-staging]
module.networking.google_compute_router.router: Refreshing state... [id=projects/quill-medical-staging/regions/europe-west2/routers/quill-router-staging]
module.networking.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fquill-medical-staging%2Fglobal%2Fnetworks%2Fquill-vpc-staging:servicenetworking.googleapis.com]
module.networking.google_compute_router_nat.nat: Refreshing state... [id=quill-medical-staging/europe-west2/quill-router-staging/quill-nat-staging]
module.cloud_sql_ehrbase[0].google_sql_database_instance.instance: Refreshing state... [id=quill-ehrbase-staging]
module.cloud_sql_fhir[0].google_sql_database_instance.instance: Refreshing state... [id=quill-fhir-staging]
module.cloud_sql_auth.google_sql_database_instance.instance: Refreshing state... [id=quill-auth-staging]
module.cloud_run_frontend.google_cloud_run_v2_service.service: Refreshing state... [id=projects/quill-medical-staging/locations/europe-west2/services/quill-frontend-staging]
module.cloud_sql_auth.google_sql_database.database: Refreshing state... [id=projects/quill-medical-staging/instances/quill-auth-staging/databases/quill_auth]
module.cloud_sql_auth.google_sql_user.user: Refreshing state... [id=quill//quill-auth-staging]
module.cloud_sql_fhir[0].google_sql_database.database: Refreshing state... [id=projects/quill-medical-staging/instances/quill-fhir-staging/databases/fhir]
module.cloud_sql_fhir[0].google_sql_user.user: Refreshing state... [id=fhir//quill-fhir-staging]
module.cloud_sql_ehrbase[0].google_sql_database.database: Refreshing state... [id=projects/quill-medical-staging/instances/quill-ehrbase-staging/databases/ehrbase]
module.cloud_sql_ehrbase[0].google_sql_user.user: Refreshing state... [id=ehrbase//quill-ehrbase-staging]
module.compute_fhir[0].google_compute_instance.fhir: Refreshing state... [id=projects/quill-medical-staging/zones/europe-west2-a/instances/fhir-ehrbase-staging]
module.cloud_run_frontend.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/quill-medical-staging/locations/europe-west2/services/quill-frontend-staging/roles/run.invoker/allUsers]
module.cloud_run_backend.google_cloud_run_v2_service.service: Refreshing state... [id=projects/quill-medical-staging/locations/europe-west2/services/quill-backend-staging]
module.cloud_run_backend.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/quill-medical-staging/locations/europe-west2/services/quill-backend-staging/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloud_run_backend.google_cloud_run_v2_service.service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "service" {
      - client                  = "gcloud" -> null
      - client_version          = "560.0.0" -> null
        id                      = "projects/quill-medical-staging/locations/europe-west2/services/quill-backend-staging"
        name                    = "quill-backend-staging"
        # (25 unchanged attributes hidden)

      ~ template {
            # (6 unchanged attributes hidden)

          ~ containers {
              ~ image      = "europe-west2-docker.pkg.dev/quill-medical-staging/quill/backend:initial" -> "gcr.io/cloudrun/hello:latest"
                # (3 unchanged attributes hidden)

              ~ env {
                  ~ name  = "FHIR_BASE_URL" -> "EHRBASE_DB_HOST"
                  ~ value = "http://10.0.0.2:8080/fhir" -> "172.23.0.5"
                }
              ~ env {
                  ~ name  = "SECURE_COOKIES" -> "EHRBASE_DB_NAME"
                  ~ value = "true" -> "ehrbase"
                }
              ~ env {
                  ~ name  = "AUTH_DB_PASSWORD" -> "EHRBASE_DB_USER"
                  + value = "ehrbase"

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth-db-password" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              ~ env {
                  ~ name  = "JWT_SECRET" -> "FHIR_BASE_URL"
                  + value = "http://10.0.0.2:8080/fhir"

                  - value_source {
                      - secret_key_ref {
                          - secret  = "jwt-secret" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              ~ env {
                  ~ name  = "VAPID_PRIVATE" -> "FHIR_DB_HOST"
                  + value = "172.23.0.7"

                  - value_source {
                      - secret_key_ref {
                          - secret  = "vapid-private" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              + env {
                  + name  = "FHIR_DB_NAME"
                  + value = "fhir"
                }
              + env {
                  + name  = "FHIR_DB_USER"
                  + value = "fhir"
                }
              + env {
                  + name  = "SECURE_COOKIES"
                  + value = "true"
                }
              + env {
                  + name = "AUTH_DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "auth-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "EHRBASE_API_ADMIN_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "ehrbase-admin-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "EHRBASE_API_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "ehrbase-api-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "EHRBASE_DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "ehrbase-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "FHIR_DB_PASSWORD"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "fhir-db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "JWT_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "jwt-secret"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "VAPID_PRIVATE"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "vapid-private"
                          + version = "latest"
                        }
                    }
                }

                # (10 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cloud_run_frontend.google_cloud_run_v2_service.service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "service" {
      - client                  = "gcloud" -> null
      - client_version          = "560.0.0" -> null
        id                      = "projects/quill-medical-staging/locations/europe-west2/services/quill-frontend-staging"
        name                    = "quill-frontend-staging"
        # (25 unchanged attributes hidden)

      ~ template {
            # (6 unchanged attributes hidden)

          ~ containers {
              ~ image      = "europe-west2-docker.pkg.dev/quill-medical-staging/quill/frontend:initial" -> "gcr.io/cloudrun/hello:latest"
                # (3 unchanged attributes hidden)

                # (4 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.load_balancer.google_compute_backend_service.backend will be created
  + resource "google_compute_backend_service" "backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "quill-bs-backend-staging"
      + port_name                       = (known after apply)
      + project                         = "quill-medical-staging"
      + protocol                        = "HTTP"
      + security_policy                 = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + log_config {
          + enable      = true
          + sample_rate = 1
        }
    }

  # module.load_balancer.google_compute_backend_service.frontend will be created
  + resource "google_compute_backend_service" "frontend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "quill-bs-frontend-staging"
      + port_name                       = (known after apply)
      + project                         = "quill-medical-staging"
      + protocol                        = "HTTP"
      + security_policy                 = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + log_config {
          + enable      = true
          + sample_rate = 1
        }
    }

  # module.load_balancer.google_compute_global_address.lb_ip will be created
  + resource "google_compute_global_address" "lb_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "quill-lb-ip-staging"
      + prefix_length      = (known after apply)
      + project            = "quill-medical-staging"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.load_balancer.google_compute_global_forwarding_rule.http will be created
  + resource "google_compute_global_forwarding_rule" "http" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "quill-http-rule-staging"
      + network               = (known after apply)
      + port_range            = "80"
      + project               = "quill-medical-staging"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)
    }

  # module.load_balancer.google_compute_global_forwarding_rule.https will be created
  + resource "google_compute_global_forwarding_rule" "https" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "quill-https-rule-staging"
      + network               = (known after apply)
      + port_range            = "443"
      + project               = "quill-medical-staging"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)
    }

  # module.load_balancer.google_compute_managed_ssl_certificate.cert will be created
  + resource "google_compute_managed_ssl_certificate" "cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "quill-cert-v2-staging"
      + project                   = "quill-medical-staging"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "staging.quill-medical.com",
            ]
        }
    }

  # module.load_balancer.google_compute_region_network_endpoint_group.backend will be created
  + resource "google_compute_region_network_endpoint_group" "backend" {
      + id                    = (known after apply)
      + name                  = "quill-neg-backend-staging"
      + network_endpoint_type = "SERVERLESS"
      + project               = "quill-medical-staging"
      + region                = "europe-west2"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "quill-backend-staging"
        }
    }

  # module.load_balancer.google_compute_region_network_endpoint_group.frontend will be created
  + resource "google_compute_region_network_endpoint_group" "frontend" {
      + id                    = (known after apply)
      + name                  = "quill-neg-frontend-staging"
      + network_endpoint_type = "SERVERLESS"
      + project               = "quill-medical-staging"
      + region                = "europe-west2"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "quill-frontend-staging"
        }
    }

  # module.load_balancer.google_compute_security_policy.waf will be created
  + resource "google_compute_security_policy" "waf" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "quill-waf-staging"
      + project     = "quill-medical-staging"
      + self_link   = (known after apply)
      + type        = (known after apply)

      + rule {
          + action      = "allow"
          + description = "Default: allow all traffic"
          + preview     = (known after apply)
          + priority    = 2147483647

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }
        }
      + rule {
          + action      = "throttle"
          + description = "Rate limit: 500 req/min per IP"
          + preview     = (known after apply)
          + priority    = 1000

          + match {
              + versioned_expr = "SRC_IPS_V1"

              + config {
                  + src_ip_ranges = [
                      + "*",
                    ]
                }
            }

          + rate_limit_options {
              + conform_action = "allow"
              + exceed_action  = "deny(429)"

              + rate_limit_threshold {
                  + count        = 500
                  + interval_sec = 60
                }
            }
        }
    }

  # module.load_balancer.google_compute_target_http_proxy.http will be created
  + resource "google_compute_target_http_proxy" "http" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "quill-http-proxy-staging"
      + project            = "quill-medical-staging"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.load_balancer.google_compute_target_https_proxy.https will be created
  + resource "google_compute_target_https_proxy" "https" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "quill-https-proxy-staging"
      + project            = "quill-medical-staging"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.load_balancer.google_compute_url_map.http_redirect will be created
  + resource "google_compute_url_map" "http_redirect" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "quill-http-redirect-staging"
      + project            = "quill-medical-staging"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect         = true
          + redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
          + strip_query            = false
        }
    }

  # module.load_balancer.google_compute_url_map.https will be created
  + resource "google_compute_url_map" "https" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "quill-url-map-staging"
      + project            = "quill-medical-staging"
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "staging.quill-medical.com",
            ]
          + path_matcher = "quill-paths"
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "quill-paths"

          + path_rule {
              + paths   = [
                  + "/api",
                  + "/api/*",
                ]
              + service = (known after apply)
            }
        }
    }

Plan: 13 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + lb_ip              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Workflow:* https://github.com/bailey-medics/quillmedical/actions/runs/23301339409